In [14]:
import pandas as pd
import numpy as np

In [33]:
oil = pd.read_csv('oil.csv')

oil.columns = ["date", "price"]

oil["euro_price"] = oil["price"] * 1.1

oil = pd.concat([oil, oil.iloc[-1:]], ignore_index=True).reset_index(drop=True)

oil.tail()

            date  price  euro_price
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986
1218  2017-08-31  47.26      51.986

In [29]:
oil.shape

(1219, 3)

In [30]:
oil.nunique(dropna=True)

date          1218
price          998
euro_price     998
dtype: int64

In [31]:
oil.duplicated(subset="price").sum()

220

In [36]:
oil.drop_duplicates()

            date  price  euro_price
0     2013-01-01    NaN         NaN
1     2013-01-02  93.14     102.454
2     2013-01-03  92.97     102.267
3     2013-01-04  93.12     102.432
4     2013-01-07  93.20     102.520
...          ...    ...         ...
1213  2017-08-25  47.65      52.415
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1217  2017-08-31  47.26      51.986

[1218 rows x 3 columns]

In [37]:
oil.drop_duplicates(keep="last")

            date  price  euro_price
0     2013-01-01    NaN         NaN
1     2013-01-02  93.14     102.454
2     2013-01-03  92.97     102.267
3     2013-01-04  93.12     102.432
4     2013-01-07  93.20     102.520
...          ...    ...         ...
1213  2017-08-25  47.65      52.415
1214  2017-08-28  46.40      51.040
1215  2017-08-29  46.46      51.106
1216  2017-08-30  45.96      50.556
1218  2017-08-31  47.26      51.986

[1218 rows x 3 columns]

In [41]:
oil.drop_duplicates(subset=["price"], keep="last", ignore_index=True)

           date  price  euro_price
0    2013-01-02  93.14     102.454
1    2013-01-03  92.97     102.267
2    2013-01-07  93.20     102.520
3    2013-01-09  93.08     102.388
4    2013-01-14  94.27     103.697
..          ...    ...         ...
994  2017-08-25  47.65      52.415
995  2017-08-28  46.40      51.040
996  2017-08-29  46.46      51.106
997  2017-08-30  45.96      50.556
998  2017-08-31  47.26      51.986

[999 rows x 3 columns]